02/web/myapp2/app/controllers/words_controller.rb

SELECT `words`.* FROM `words`
---
  def index
    @words = Word.all

INSERT INTO `words` (`japanese`, `english`, `created_at`, `updated_at`) VALUES ('りんご', 'apple', '2023-02-20 16:09:45.859364', '2023-02-20 16:09:45.859364')
---
  def create
    @word = Word.new(word_params)

    respond_to do |format|
      if @word.save

SELECT `words`.* FROM `words` WHERE `words`.`id` = 1 LIMIT 1
---
    def set_word
      @word = Word.find(params[:id])